from pandas import DataFrame as df

# 딕셔너리를 원소로 갖는 리스트
grade_dic = [{'국어': 98, '영어': None, '수학': 88,'과학': 63},
             {'국어': 88, '영어': 90, '수학': 62,'과학': 50},
             {'국어': 92, '영어': 70, '수학': None,'과학': 70},
             {'국어': 63, '영어': 60, '수학': 31,'과학': None},
             {'국어': 23, '영어': 48, '수학': None,'과학': 69}]

# 딕셔너리의 키값이 컬럼의 이름으로 지정됨
# 리스트를 원소로 갖는 딕셔너리를 사용하면, 인덱스만 따로 지정함
data = df(grade_dic, index=['철수','영희','민철','수현','호영'])
print(data)
print('-'*40)

# 1. 리스트를 사용한 행 추가
# 누락되는 값이 있거나, 값의 수가 초과될 경우 에러 발생
data.loc['차유리'] = 90,80,70,60
print(data)
print('-'*40)

# 2. 딕셔너리를 사용한 행 추가
# 빈 값을 적용해야하는 경우에는, None이라고 지정한다.
data.loc['민도희'] = {'국어':100,'영어':99,'수학':98,'과학':97}
print(data)
print('-'*40)

# 3. 행 복사로 추가
data.loc['박새로이'] = data.loc['철수']
print(data)
print('-'*40)

# 4. 행단위 데이터 통째로 바꾸기
data.loc['차유리'] = 60,80,70,90
print(data)
print('-'*40)

# 5. 다른 데이터프레임과 병합
# => 제외된 열에 대해서는 Nan으로 설정됨
tmp = df({'국어':100 ,'수학':100,'과학':100}, index=['조이서'])
print(tmp)
print('-'*40)

# 원본은 그대로 존재함
data1 = data.append(tmp)
print(data1)
print('-'*40)
